src/cf/InformationRegisters/DataProcessedInMasterDIBNode.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>DataProcessedInMasterDIBNode</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IndependentRegisterFiltersValues</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ExchangePlanNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MetadataObject</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Queue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UniqueKey</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/DataProcessedInMasterDIBNode/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Fills in the register of updated data to pass to the subordinate DIB nodes.
//
// Parameters:
//  PositionInQueue - Number - the position in the queue for the current handler.
//  Data - Ref, Array, DataSet - data, by which you need to register changes.
//            Registration by the independent information register is not supported.
//  AdditionalParameters - Structure - see InfobaseUpdate.AdditionalProcessingMarkParameters. 
//
Procedure MarkProcessingCompletion(Queue, Data, AdditionalParameters) Export
	
	If (SessionParameters.UpdateHandlerParameters.ExecuteInMasterNodeOnly 
			AND Not StandardSubsystemsCached.DIBUsed())
			Or (Not SessionParameters.UpdateHandlerParameters.ExecuteInMasterNodeOnly
				AND Not StandardSubsystemsCached.DIBUsed("WithFilter"))
			Or SessionParameters.UpdateHandlerParameters.RunAlsoInSubordinateDIBNodeWithFilters Then
		Return;
	EndIf;
	
	DataType = TypeOf(Data);
	
	If DataType = Type("Array")
		AND Data.Count() = 0 Then
		Return;
	EndIf;
	
	If SessionParameters.UpdateHandlerParameters.ExecuteInMasterNodeOnly Then
		DIBNodes = StandardSubsystemsCached.DIBNodes();
	Else
		DIBNodes = StandardSubsystemsCached.DIBNodes("WithFilter");
	EndIf;
	
	If DIBNodes.Count() = 0 Then
		Return;
	EndIf;
	
	If AdditionalParameters.IsRegisterRecords
		Or AdditionalParameters.IsIndependentInformationRegister Then
		MetadataObjectID = Common.MetadataObjectID(AdditionalParameters.FullRegisterName);
	Else
		
		If DataType = Type("Array") Then
			MetadataObjectID = Undefined;
		Else
			MetadataObjectID = Common.MetadataObjectID(DataType);
		EndIf;
		
	EndIf;
	
	DataSet = CreateRecordSet();
	
	If ValueIsFilled(MetadataObjectID) Then
		DataSet.Filter.MetadataObject.Set(MetadataObjectID);
	EndIf;
	
	DataSet.Filter.Queue.Set(Queue);
	
	If AdditionalParameters.IsRegisterRecords Then
		AddDataToSet(DIBNodes, DataSet, Data);
	ElsIf AdditionalParameters.IsIndependentInformationRegister Then
		
		For Each StrTabl In Data Do
			
			DimensionValueStructure = New Structure;
			GUID                       = New UUID;
			
			DataSet.Filter.UniqueKey.Set(GUID);
			
			For Each FilterItem In Data.Columns Do
				DimensionValueStructure.Insert(FilterItem.Name, StrTabl[FilterItem.Name]);
			EndDo;
			
			For Each DIBNode In DIBNodes Do
				
				NewRow = DataSet.Add();
				
				NewRow.ExchangePlanNode                     = DIBNode.Value;
				NewRow.MetadataObject                    = MetadataObjectID;
				NewRow.UniqueKey                    = GUID;
				NewRow.Queue                             = Queue;
				NewRow.IndependentRegisterFiltersValues = New ValueStorage(DimensionValueStructure, New Deflation(9));
				
			EndDo;
			
			WriteSetWithoutStandardChangeRegistration(DataSet, DIBNodes);
			
			DataSet = CreateRecordSet();
			If ValueIsFilled(MetadataObjectID) Then
				DataSet.Filter.MetadataObject.Set(MetadataObjectID);
			EndIf;
			DataSet.Filter.Queue.Set(Queue);
			
		EndDo;
		
	Else
		If TypeOf(Data) <> Type("Array") Then
			
			MetadataObject = Metadata.FindByType(DataType);
			If Common.IsConstant(MetadataObject) Then
				Return;
			EndIf;
			
			If Common.IsInformationRegister(MetadataObject)
				AND MetadataObject.WriteMode = Metadata.ObjectProperties.RegisterWriteMode.Independent Then
				
				DimensionValueStructure = New Structure;
				GUID                       = New UUID;
				
				DataSet.Filter.UniqueKey.Set(GUID);
				
				For Each FilterItem In Data.Filter Do
					DimensionValueStructure.Insert(FilterItem.Name, FilterItem.Value);
				EndDo;
				
				For Each DIBNode In DIBNodes Do
					
					NewRow = DataSet.Add();
					
					NewRow.ExchangePlanNode                     = DIBNode.Value;
					NewRow.MetadataObject                    = MetadataObjectID;
					NewRow.UniqueKey                    = GUID;
					NewRow.Queue                             = Queue;
					NewRow.IndependentRegisterFiltersValues = New ValueStorage(DimensionValueStructure, New Deflation(9));
					
				EndDo;
				
				WriteSetWithoutStandardChangeRegistration(DataSet, DIBNodes);
				Return;
				
			EndIf;
			
			AddDataToSet(DIBNodes, DataSet, Data, MetadataObject);
			
		Else
			
			AddDataToSet(DIBNodes, DataSet, Data, , Queue);
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

Procedure AddDataToSet(DIBNodes, DataSet, Data, MetadataObject = Undefined, Queue = Undefined)
	
	If TypeOf(Data) = Type("Array") Then
		
		For Each ArrayRow In Data Do
			
			DataSet = CreateRecordSet();
			DataSet.Filter.Data.Set(ArrayRow);
			DataSet.Filter.Queue.Set(Queue);
			DataSet.Filter.MetadataObject.Set(Common.MetadataObjectID(TypeOf(ArrayRow)));
			
			For Each DIBNode In DIBNodes Do
				NewRow = DataSet.Add();
				
				NewRow.ExchangePlanNode  = DIBNode.Value;
				NewRow.MetadataObject = DataSet.Filter.MetadataObject.Value;
				NewRow.Data           = ArrayRow;
				NewRow.Queue          = DataSet.Filter.Queue.Value;
				
			EndDo;
			
			WriteSetWithoutStandardChangeRegistration(DataSet, DIBNodes);
			
		EndDo;
		
	Else
		
		Value = Undefined;
		
		If MetadataObject = Undefined Then
			MetadataObject = Metadata.FindByType(TypeOf(Data));
		EndIf;
		
		If Common.IsReference(TypeOf(Data)) Then
			Value = Data;
		ElsIf Common.IsRefTypeObject(MetadataObject) Then
			Value = Data.Ref;
		Else
			Value = Data.Filter.Recorder.Value;
		EndIf;
		
		DataSet.Filter.Data.Set(Value);
		
		If Not DataSet.Filter.MetadataObject.Use
			Or Not ValueIsFilled(DataSet.Filter.MetadataObject.Value) Then
			DataSet.Filter.MetadataObject.Set(Common.MetadataObjectID(TypeOf(Value)));
		EndIf;
		
		For Each DIBNode In DIBNodes Do
			
			NewRow = DataSet.Add();
			
			NewRow.ExchangePlanNode  = DIBNode.Value;
			NewRow.MetadataObject = DataSet.Filter.MetadataObject.Value;
			NewRow.Data           = Value;
			NewRow.Queue          = DataSet.Filter.Queue.Value;
			
		EndDo;
		
		WriteSetWithoutStandardChangeRegistration(DataSet, DIBNodes);
		
	EndIf;
	
EndProcedure

Procedure WriteSetWithoutStandardChangeRegistration(DataSet, DIBNodes)
	
	// Write a set, replacing the standard registration logic by your own.
	SetToRegister = CreateRecordSet();
	For Each FilterItem In DataSet.Filter Do
		SetToRegister.Filter[FilterItem.Name].Set(FilterItem.Value);
	EndDo;
	
	For Each ListItem In DIBNodes Do
		
		DIBNode = ListItem.Value;
		SetToRegister.Filter.ExchangePlanNode.Set(DIBNode);
		ExchangePlans.RecordChanges(DIBNode, SetToRegister);
		
	EndDo;
	
	DataSet.AdditionalProperties.Insert("DisableObjectChangeRecordMechanism");
	DataSet.Write();
	
EndProcedure

#EndRegion

#EndIf
